Repository: zziri/cmux
Catalog: Resources/Localizable.xcstrings
Source language: en
Languages: ar, bs, da, de, es, fr, it, ja, ko, nb, pl, pt_br, ru, th, tr, uk, zh_hans, zh_hant

# settings.browser.remoteDebuggingPort
source: Chromium Remote Debugging Port
ar: منفذ تصحيح الأخطاء عن بعد لـ Chromium
de: Port für Chromium-Remote-Debugging
es: Puerto de depuración remota de Chromium
fr: Port de débogage à distance de Chromium
ja: Chromiumリモートデバッグポート
ko: Chromium 원격 디버깅 포트
zh_hans: Chromium 远程调试端口
zh_hant: Chromium 遠端偵錯連接埠

# settings.browser.remoteDebuggingPort.subtitleOff
source: Off by default. Chromium panes still use private CDP internally; no external endpoint is exposed.
ar: معطل افتراضيًا. لا تزال أجزاء Chromium تستخدم بروتوكول CDP الخاص داخليًا؛ لا يتم كشف أي نقطة نهاية خارجية.
de: Standardmäßig deaktiviert. Chromium-Bereiche verwenden intern weiterhin privates CDP; es wird kein externer Endpunkt freigegeben.
es: Desactivado por defecto. Los paneles de Chromium siguen utilizando CDP privado internamente; no se expone ningún extremo externo.
fr: Désactivé par défaut. Les volets Chromium utilisent toujours un CDP privé en interne ; aucun point de terminaison externe n'est exposé.
ja: デフォルトはオフです。Chromiumペインは内部で非公開CDPを使用しますが、外部エンドポイントは公開されません。
ko: 기본적으로 꺼져 있습니다. Chromium 패인은 여전히 내부적으로 비공개 CDP를 사용하며, 외부 엔드포인트는 노출되지 않습니다.
zh_hans: 默认关闭。Chromium 窗格在内部仍使用私有 CDP；不公开任何外部端点。
zh_hant: 預設為關閉。Chromium 窗格內部仍使用私有 CDP；不公開外部端點。

# settings.browser.remoteDebuggingPort.subtitleOn
source: New panes request http://127.0.0.1:%lld. If busy, cmux chooses another loopback port; CLI JSON reports the actual Playwright endpoint.
ar: تطلب الأجزاء الجديدة http://127.0.0.1:%lld. إذا كان مشغولاً، يختار cmux منفذ استرجاع آخر؛ يبلغ تنسيق JSON الخاص بـ CLI عن نقطة نهاية Playwright الفعلية.
de: Neue Bereiche fordern http://127.0.0.1:%lld an. Wenn dieser belegt ist, wählt cmux einen anderen Loopback-Port; der CLI-JSON-Bericht meldet den tatsächlichen Playwright-Endpunkt.
es: Los nuevos paneles solicitan http://127.0.0.1:%lld. Si está ocupado, cmux elige otro puerto de bucle invertido; el JSON de la CLI informa el extremo real de Playwright.
fr: Les nouveaux volets demandent http://127.0.0.1:%lld. S'il est occupé, cmux choisit un autre port de bouclage (loopback) ; le JSON de la CLI indique le point de terminaison Playwright réel.
ja: 新しいペインではhttp://127.0.0.1:%lldを要求します。使用中の場合は別のループバックポートを使用し、CLIのJSONに実際のPlaywrightエンドポイントが表示されます。
ko: 새 패인은 http://127.0.0.1:%lld 포트를 요청합니다. 포트가 사용 중인 경우, cmux는 다른 루프백 포트를 대신 선택하며, CLI JSON은 실제 Playwright 엔드포인트를 보고합니다.
zh_hans: 新窗格请求 http://127.0.0.1:%lld。如果该端口被占用，cmux 会选择另一个环回端口；CLI JSON 会报告实际的 Playwright 端点。
zh_hant: 新窗格會要求 http://127.0.0.1:%lld。若已被佔用，cmux 會選擇另一個回環 (loopback) 連接埠；CLI JSON 會回報實際的 Playwright 端點。

# settings.search.alias.setting.browser.chromium-extensions
source: browser.chromiumExtensionDirectories chrome extension unpacked load-extension addon plugin
ar: browser.chromiumExtensionDirectories chrome extension unpacked load-extension addon plugin امتداد كروم غير مضغوط ملحق إضافة
de: browser.chromiumExtensionDirectories chrome extension unpacked load-extension addon plugin browser.chromiumErweiterungsverzeichnisse chrom erweiterung entpackt erweiterung-laden addon plugin
es: browser.chromiumExtensionDirectories chrome extension unpacked load-extension addon plugin extensiones directorio complementos descomprimida
fr: browser.chromiumExtensionDirectories chrome extension unpacked load-extension addon plugin extension non empaquetée module complémentaire greffon répertoire
ja: browser.chromiumExtensionDirectories chrome extension unpacked load-extension addon plugin browser.chromiumExtensionDirectories Chrome 拡張機能 アンパック load-extension アドオン プラグイン
ko: browser.chromiumExtensionDirectories chrome extension unpacked load-extension addon plugin 브라우저 크로미움 확장 프로그램 압축해제 로드 확장기능 플러그인
zh_hans: browser.chromiumExtensionDirectories chrome extension unpacked load-extension addon plugin 浏览器扩展 谷歌浏览器扩展 未打包 加载扩展 插件
zh_hant: browser.chromiumExtensionDirectories chrome extension unpacked load-extension addon plugin 瀏覽器 擴充功能 未封裝 載入 附加元件 外掛程式

# settings.search.alias.setting.browser.engine
source: browser.defaultEngine auto match default browser webkit chromium chrome rendering engine out of process
ar: browser.defaultEngine auto match default browser webkit chromium chrome rendering engine out of process محرك متصفح افتراضي تلقائي ويب كيت كروميوم كروم رندر خارج العملية
de: browser.defaultEngine auto match default browser webkit chromium chrome rendering engine out of process browser.standardEngine automatisch standardbrowser anpassen rendering-engine out-of-process
es: browser.defaultEngine auto match default browser webkit chromium chrome rendering engine out of process motor predeterminado automático coincidir navegador renderizado fuera de proceso
fr: browser.defaultEngine auto match default browser webkit chromium chrome rendering engine out of process moteur de navigateur par défaut moteur de rendu hors processus automatique
ja: browser.defaultEngine auto match default browser webkit chromium chrome rendering engine out of process browser.defaultEngine 自動 既定のブラウザ WebKit Chromium Chrome レンダリング エンジン 別プロセス
ko: browser.defaultEngine auto match default browser webkit chromium chrome rendering engine out of process 브라우저 엔진 기본 자동 일치 웹킷 크로미움 렌더링엔진 아웃오브프로세스
zh_hans: browser.defaultEngine auto match default browser webkit chromium chrome rendering engine out of process 默认浏览器引擎 自动 匹配 渲染引擎 进程外
zh_hant: browser.defaultEngine auto match default browser webkit chromium chrome rendering engine out of process 瀏覽器 引擎 自動 符合 預設 轉譯 跨程序

# settings.search.alias.setting.browser.remote-debugging-port
source: browser.remoteDebuggingPort cdp devtools protocol playwright puppeteer loopback localhost attach
ar: browser.remoteDebuggingPort cdp devtools protocol playwright puppeteer loopback localhost attach منفذ تصحيح الأخطاء عن بعد محلي ربط
de: browser.remoteDebuggingPort cdp devtools protocol playwright puppeteer loopback localhost attach remote-debugging-port entwicklertools-protokoll loopback localhost verbinden
es: browser.remoteDebuggingPort cdp devtools protocol playwright puppeteer loopback localhost attach puerto depuración remota protocolo bucle invertido conectar
fr: browser.remoteDebuggingPort cdp devtools protocol playwright puppeteer loopback localhost attach port de débogage à distance bouclage attacher
ja: browser.remoteDebuggingPort cdp devtools protocol playwright puppeteer loopback localhost attach browser.remoteDebuggingPort CDP DevTools プロトコル Playwright Puppeteer ループバック localhost 接続
ko: browser.remoteDebuggingPort cdp devtools protocol playwright puppeteer loopback localhost attach 브라우저 원격 디버깅 포트 개발자도구 프로토콜 플레이라이트 퍼피티어 루프백 로컬호스트 연결
zh_hans: browser.remoteDebuggingPort cdp devtools protocol playwright puppeteer loopback localhost attach 远程调试端口 开发者工具 协议 环回 本地主机 连接 附着
zh_hant: browser.remoteDebuggingPort cdp devtools protocol playwright puppeteer loopback localhost attach 瀏覽器 遠端偵錯 連接埠 開發者工具 協定 本機 附加

# titlebar.cloudVM.menu.accessibilityLabel
source: Cloud VM Menu
ar: قائمة جهاز Cloud VM
de: Cloud-VM-Menü
es: Menú de VM en la nube
fr: Menu de la VM Cloud
ja: Cloud VM メニュー
ko: Cloud VM 메뉴
zh_hans: 云虚拟机菜单
zh_hant: Cloud VM 功能表

# titlebar.cloudVM.menu.tooltip
source: Cloud VM actions
ar: إجراءات جهاز Cloud VM
de: Cloud-VM-Aktionen
es: Acciones de VM en la nube
fr: Actions de la VM Cloud
ja: Cloud VM アクション
ko: Cloud VM 작업
zh_hans: 云虚拟机操作
zh_hant: Cloud VM 動作

# titlebar.cloudVM.tooltip
source: Open Cloud VM
ar: فتح جهاز Cloud VM
de: Cloud-VM öffnen
es: Abrir VM en la nube
fr: Ouvrir la VM Cloud
ja: Cloud VM を開く
ko: Cloud VM 열기
zh_hans: 打开云虚拟机
zh_hant: 開啟 Cloud VM

# cloudTunnel.error.backendUnavailable
source: This cmux build does not include the signed Network Extension required for browser access.
ar: لا يتضمن إصدار cmux هذا امتداد الشبكة المُوقع والمطلوب للوصول إلى المتصفح.
de: Dieses cmux-Build enthält nicht die für den Browserzugriff erforderliche signierte Netzwerk-Extension.
es: Esta compilación de cmux no incluye la extensión de red firmada requerida para el acceso del navegador.
fr: Cette version de cmux n'inclut pas l'extension réseau signée requise pour l'accès au navigateur.
ja: この cmux ビルドには、ブラウザアクセスに必要な署名済み Network Extension が含まれていません。
ko: 이 cmux 빌드에는 브라우저 접근에 필요한 서명된 네트워크 확장 프로그램이 포함되어 있지 않습니다.
zh_hans: 此 cmux 构建版本不包含浏览器访问所需的签名网络扩展。
zh_hant: 此 cmux 版本不包含瀏覽器存取所需的已簽署「網路延伸功能」。

# cloudTunnel.error.notSignedIn
source: Sign in to cmux Cloud first (`cmux auth login`), then retry.
ar: سجل الدخول إلى cmux Cloud أولاً (`cmux auth login`)، ثم حاول مجددًا.
de: Melden Sie sich zuerst bei cmux Cloud an (`cmux auth login`) und versuchen Sie es dann erneut.
es: Inicie sesión en cmux Cloud primero (`cmux auth login`), luego vuelva a intentarlo.
fr: Connectez-vous d'abord à cmux Cloud (`cmux auth login`), puis réessayez.
ja: まず cmux Cloud にサインイン（`cmux auth login`）してから再試行してください。
ko: 먼저 cmux Cloud에 로그인(`cmux auth login`)한 후 다시 시도하세요.
zh_hans: 请先登录 cmux Cloud（`cmux auth login`），然后重试。
zh_hant: 請先登入 cmux Cloud (使用 `cmux auth login`)，然後重試。

# cloudTunnel.error.rebootRequired
source: macOS needs a restart to finish installing the cmux Cloud Tunnel extension.
ar: يحتاج نظام macOS إلى إعادة التشغيل لإنهاء تثبيت امتداد cmux Cloud Tunnel.
de: macOS erfordert einen Neustart, um die Installation der cmux Cloud Tunnel-Extension abzuschließen.
es: macOS necesita reiniciarse para finalizar la instalación de la extensión Túnel en la nube de cmux.
fr: macOS nécessite un redémarrage pour terminer l'installation de l'extension Tunnel Cloud cmux.
ja: cmux クラウドトンネル機能拡張のインストールを完了するには macOS の再起動が必要です。
ko: cmux Cloud Tunnel 확장 프로그램의 설치를 완료하려면 macOS를 재시동해야 합니다.
zh_hans: macOS 需要重新启动以完成 cmux 云隧道扩展的安装。
zh_hant: macOS 需要重新啟動以完成 cmux Cloud Tunnel 延伸功能的安裝。

# cloudTunnel.error.appNotInApplicationsFolder
source: macOS only loads the cmux Cloud Tunnel extension from the Applications folder. Move cmux.app to /Applications and retry.
ar: يقوم نظام macOS بتحميل امتداد cmux Cloud Tunnel من مجلد التطبيقات (Applications) فقط. انقل cmux.app إلى /Applications وحاول مجددًا.
de: macOS lädt die cmux Cloud Tunnel-Extension nur aus dem Programme-Ordner. Verschieben Sie cmux.app nach /Applications und versuchen Sie es erneut.
es: macOS solo carga la extensión Túnel en la nube de cmux desde la carpeta Aplicaciones. Mueva cmux.app a /Applications y vuelva a intentarlo.
fr: macOS charge uniquement l'extension Tunnel Cloud cmux depuis le dossier Applications. Déplacez cmux.app vers /Applications et réessayez.
ja: macOS は「アプリケーション」フォルダにある cmux からのみクラウドトンネル機能拡張を読み込みます。cmux.app を /Applications に移動して再試行してください。
ko: macOS는 응용 프로그램(Applications) 폴더에서만 cmux Cloud Tunnel 확장 프로그램을 로드할 수 있습니다. cmux.app을 /Applications 폴더로 이동한 후 다시 시도하세요.
zh_hans: macOS 仅支持从“应用程序”文件夹加载 cmux 云隧道扩展。请将 cmux.app 移动到 /Applications，然后重试。
zh_hant: macOS 僅從「應用程式」檔案夾載入 cmux Cloud Tunnel 延伸功能。請將 cmux.app 移動到 /Applications 後重試。

# cloudTunnel.error.startFailed
source: The tunnel could not start: %@
ar: تعذر بدء النفق: %@
de: Der Tunnel konnte nicht gestartet werden: %@
es: El túnel no pudo iniciarse: %@
fr: Le tunnel n'a pas pu démarrer : %@
ja: トンネルを開始できませんでした: %@
ko: 터널을 시작할 수 없습니다: %@
zh_hans: 隧道无法启动：%@
zh_hant: 通道無法啟動：%@

# cloudTunnel.error.deadlineExceeded
source: The tunnel did not come up in time.
ar: لم يتم تشغيل النفق في الوقت المحدد.
de: Der Tunnel wurde nicht rechtzeitig aufgebaut.
es: El túnel no se activó a tiempo.
fr: Le tunnel ne s'est pas activé à temps.
ja: トンネルが時間内に接続されませんでした。
ko: 제한 시간 내에 터널이 연결되지 않았습니다.
zh_hans: 隧道未能在规定时间内启动。
zh_hant: 通道未在時間內啟動。

# cloudTunnel.error.linkDropped
source: macOS reported the VPN as disconnected before it came up.
ar: أبلغ نظام macOS عن قطع اتصال VPN قبل أن يتم تشغيلها.
de: macOS hat gemeldet, dass die VPN-Verbindung getrennt wurde, bevor sie aufgebaut war.
es: macOS reportó la VPN como desconectada antes de que se activara.
fr: macOS a signalé que le VPN était déconnecté avant qu'il ne soit activé.
ja: 接続が確立する前に macOS が VPN の切断を報告しました。
ko: 터널이 연결되기 전에 macOS가 VPN 연결 해제를 보고했습니다.
zh_hans: macOS 在 VPN 启动前便报告其已断开连接。
zh_hant: macOS 在 VPN 啟動前回報已中斷連線。

# cloudTunnel.error.linkStatusUnavailable
source: VPN status updates stopped arriving.
ar: توقفت تحديثات حالة VPN عن الوصول.
de: Es gingen keine VPN-Statusaktualisierungen mehr ein.
es: Dejaron de llegar actualizaciones de estado de la VPN.
fr: Les mises à jour de statut du VPN ont cessé d'arriver.
ja: VPN の状態更新が届かなくなりました。
ko: VPN 상태 업데이트 수신이 중단되었습니다.
zh_hans: VPN 状态更新已停止接收。
zh_hant: VPN 狀態更新已停止傳送。

# cloudTunnel.error.genericFailure
source: cmux could not start the Cloud VPN. Try again.
ar: لم يتمكن cmux من بدء اتصال Cloud VPN. حاول مجددًا.
de: cmux konnte das Cloud-VPN nicht starten. Versuchen Sie es erneut.
es: cmux no pudo iniciar la VPN de la nube. Inténtelo de nuevo.
fr: cmux n'a pas pu démarrer le VPN Cloud. Réessayez.
ja: cmux はクラウド VPN を開始できませんでした。もう一度お試しください。
ko: cmux가 Cloud VPN을 시작할 수 없습니다. 다시 시도해 주세요.
zh_hans: cmux 无法启动云 VPN。请重试。
zh_hant: cmux 無法啟動雲端 VPN。請再試一次。

# cloudTunnel.error.vpnConfiguration
source: macOS rejected the VPN configuration (code %d).
ar: رفض نظام macOS تكوين VPN (الرمز %d).
de: macOS hat die VPN-Konfiguration abgelehnt (Code %d).
es: macOS rechazó la configuración de VPN (código %d).
fr: macOS a rejeté la configuration VPN (code %d).
ja: macOS が VPN 構成を拒否しました（コード %d）。
ko: macOS가 VPN 구성을 거부했습니다 (코드 %d).
zh_hans: macOS 拒绝了 VPN 配置（错误码 %d）。
zh_hant: macOS 拒絕了 VPN 設定 (代碼 %d)。

# cloudTunnel.error.activationCanceled
source: The request to load the cmux Cloud Tunnel extension was canceled.
ar: تم إلغاء طلب تحميل امتداد cmux Cloud Tunnel.
de: Die Anforderung zum Laden der cmux Cloud Tunnel-Extension wurde abgebrochen.
es: Se canceló la solicitud para cargar la extensión Túnel en la nube de cmux.
fr: La demande de chargement de l'extension Tunnel Cloud cmux a été annulée.
ja: cmux クラウドトンネル機能拡張の読み込み要求がキャンセルされました。
ko: cmux Cloud Tunnel 확장 프로그램 로드 요청이 취소되었습니다.
zh_hans: 加载 cmux 云隧道扩展的请求已被取消。
zh_hant: 載入 cmux Cloud Tunnel 延伸功能的請求已取消。

# cloudTunnel.error.activationNotAllowed
source: macOS did not allow the cmux Cloud Tunnel extension to load. Allow it in System Settings › General › Login Items & Extensions, then retry.
ar: لم يسمح نظام macOS بتحميل امتداد cmux Cloud Tunnel. اسمح به في إعدادات النظام › عام › عناصر تسجيل الدخول والامتدادات، ثم حاول مجددًا.
de: macOS hat das Laden der cmux Cloud Tunnel-Extension nicht zugelassen. Erlauben Sie es unter Systemeinstellungen › Allgemein › Anmeldeobjekte & Erweiterungen, und versuchen Sie es erneut.
es: macOS no permitió cargar la extensión Túnel en la nube de cmux. Permítala en Ajustes del Sistema › General › Ítems de inicio y extensiones, luego vuelva a intentarlo.
fr: macOS n'a pas autorisé le chargement de l'extension Tunnel Cloud cmux. Autorisez-la dans Réglages Système › Général › Ouverture et extensions, puis réessayez.
ja: macOS が cmux クラウドトンネル機能拡張の読み込みを許可しませんでした。「システム設定」›「一般」›「ログイン項目と機能拡張」で許可してから再試行してください。
ko: macOS에서 cmux Cloud Tunnel 확장 프로그램의 로드를 허용하지 않았습니다. 시스템 설정 › 일반 › 로그인 항목 및 확장 프로그램에서 허용한 후 다시 시도하세요.
zh_hans: macOS 不允许加载 cmux 云隧道扩展。请在“系统设置 › 通用 › 登录项与扩展”中允许它，然后重试。
zh_hant: macOS 不允許載入 cmux Cloud Tunnel 延伸功能。請在「系統設定」›「一般」›「登入項目與延伸功能」中允許它，然後重試。

# cloudTunnel.error.activationFailed
source: macOS could not load the cmux Cloud Tunnel extension (code %d).
ar: لم يتمكن نظام macOS من تحميل امتداد cmux Cloud Tunnel (الرمز %d).
de: macOS konnte die cmux Cloud Tunnel-Extension nicht laden (Code %d).
es: macOS no pudo cargar la extensión Túnel en la nube de cmux (código %d).
fr: macOS n'a pas pu charger l'extension Tunnel Cloud cmux (code %d).
ja: macOS が cmux クラウドトンネル機能拡張を読み込めませんでした（コード %d）。
ko: macOS가 cmux Cloud Tunnel 확장 프로그램을 로드할 수 없습니다 (코드 %d).
zh_hans: macOS 无法加载 cmux 云隧道扩展（错误码 %d）。
zh_hant: macOS 無法載入 cmux Cloud Tunnel 延伸功能 (代碼 %d)。

# cli.vpn.appManaged.bringingUp
source: Bringing the tunnel up (app-managed, no sudo needed)…
ar: جاري تشغيل النفق (مُدار بواسطة التطبيق، لا يلزم sudo)…
de: Tunnel wird aufgebaut (App-gesteuert, kein sudo erforderlich)…
es: Activando el túnel (administrado por la aplicación, no se necesita sudo)…
fr: Activation du tunnel (géré par l'application, pas besoin de sudo)…
ja: トンネルを接続しています（アプリ管理、sudo 不要）…
ko: 터널을 연결하는 중 (앱 관리형, sudo 권한 불필요)…
zh_hans: 正在启动隧道（应用托管，无需 sudo）…
zh_hant: 正在啟動通道 (應用程式管理，不需要 sudo)…

# cli.vpn.appManaged.needsApproval
source: macOS needs your approval to load the cmux Cloud Tunnel extension. Open System Settings › General › Login Items & Extensions › Network Extensions, allow cmux, then return here (waiting up to 10 minutes)…
ar: يحتاج نظام macOS إلى موافقتك لتحميل امتداد cmux Cloud Tunnel. افتح إعدادات النظام › عام › عناصر تسجيل الدخول والامتدادات › امتدادات الشبكة، واسمح لـ cmux، ثم عد إلى هنا (الانتظار لمدة تصل إلى 10 دقائق)…
de: macOS benötigt Ihre Zustimmung, um die cmux Cloud Tunnel-Extension zu laden. Öffnen Sie die Systemeinstellungen › Allgemein › Anmeldeobjekte & Erweiterungen › Netzwerk-Extensions, erlauben Sie cmux, und kehren Sie dann hierher zurück (Wartezeit bis zu 10 Minuten)…
es: macOS necesita su aprobación para cargar la extensión Túnel en la nube de cmux. Abra Ajustes del Sistema › General › Ítems de inicio y extensiones › Extensiones de red, permita cmux, luego regrese aquí (esperando hasta 10 minutos)…
fr: macOS a besoin de votre autorisation pour charger l'extension Tunnel Cloud cmux. Ouvrez Réglages Système › Général › Ouverture et extensions › Extensions réseau, autorisez cmux, puis revenez ici (attente jusqu'à 10 minutes)…
ja: cmux クラウドトンネル機能拡張を読み込むには macOS での承認が必要です。「システム設定」›「一般」›「ログイン項目と機能拡張」›「ネットワーク機能拡張」で cmux を許可してからここに戻ってください（最大 10 分待機します）…
ko: cmux Cloud Tunnel 확장 프로그램을 로드하려면 macOS의 승인이 필요합니다. 시스템 설정 › 일반 › 로그인 항목 및 확장 프로그램 › 네트워크 확장 프로그램에서 cmux를 허용한 다음 여기로 돌아오세요 (최대 10분 대기)…
zh_hans: macOS 需要您的批准才能加载 cmux 云隧道扩展。请打开“系统设置 › 通用 › 登录项与扩展 › 网络扩展”，允许 cmux，然后返回此处（最多等待 10 分钟）…
zh_hant: macOS 需要您的核准才能載入 cmux Cloud Tunnel 延伸功能。請開啟「系統設定」›「一般」›「登入項目與延伸功能」›「網路延伸功能」，允許 cmux，然後返回此處 (最多等待 10 分鐘)…

# cli.vpn.appManaged.pinned
source: Pinned up until `cmux vpn down`. Otherwise cmux starts the tunnel when you open a Cloud machine and stops it when no Cloud sessions remain.
ar: مثبت حتى تنفيذ `cmux vpn down`. بخلاف ذلك، يبدأ cmux النفق عندما تفتح جهاز Cloud ويوقفه عندما لا تتبقى أي جلسات Cloud.
de: Angeheftet bis `cmux vpn down`. Andernfalls startet cmux den Tunnel, wenn Sie eine Cloud-Maschine öffnen, und stoppt ihn, wenn keine Cloud-Sitzungen mehr verbleiben.
es: Anclado activo hasta `cmux vpn down`. De lo contrario, cmux inicia el túnel cuando abre una máquina de la nube y lo detiene cuando no quedan sesiones en la nube.
fr: Épinglé jusqu'à l'exécution de `cmux vpn down`. Sinon, cmux démarre le tunnel lorsque vous ouvrez une machine Cloud et l'arrête lorsqu'il ne reste plus de sessions Cloud.
ja: `cmux vpn down` を実行するまで接続を維持します。通常は、クラウドマシンを開くと cmux がトンネルを開始し、クラウドセッションがなくなると停止します。
ko: `cmux vpn down`을 실행할 때까지 연결 상태를 고정합니다. 그렇지 않은 경우, cmux는 Cloud 머신을 열 때 터널을 시작하고 남아 있는 Cloud 세션이 없을 때 터널을 중지합니다.
zh_hans: 保持开启状态，直到运行 `cmux vpn down`。否则，cmux 会在您打开云机器时启动隧道，并在没有云会话残留时停止隧道。
zh_hant: 固定啟用，直到執行 `cmux vpn down`。否則，cmux 會在您開啟雲端機器時啟動通道，並在沒有殘留任何雲端工作階段時停止通道。

# cli.vpn.appManaged.hostsHint
source: Internal hostnames: run `cmux vpn hosts` to map <machine>.internal in /etc/hosts (needs sudo).
ar: أسماء المضيفين الداخلية: قم بتشغيل `cmux vpn hosts` لتعيين <machine>.internal في ملف /etc/hosts (يتطلب sudo).
de: Interne Hostnamen: Führen Sie `cmux vpn hosts` aus, um <machine>.internal in /etc/hosts zuzuordnen (erfordert sudo).
es: Nombres de host internos: ejecute `cmux vpn hosts` para mapear <machine>.internal en /etc/hosts (requiere sudo).
fr: Noms d'hôtes internes : exécutez `cmux vpn hosts` pour mapper <machine>.internal dans /etc/hosts (nécessite sudo).
ja: 内部ホスト名: <machine>.internal を /etc/hosts に登録するには `cmux vpn hosts` を実行してください（sudo が必要）。
ko: 내부 호스트 이름: `cmux vpn hosts`를 실행하여 /etc/hosts에 <machine>.internal을 매핑할 수 있습니다 (sudo 권한 필요).
zh_hans: 内部主机名：运行 `cmux vpn hosts` 以在 /etc/hosts 中映射 <machine>.internal（需要 sudo）。
zh_hant: 內部主機名稱：執行 `cmux vpn hosts` 以在 /etc/hosts 中對應 <machine>.internal (需要 sudo)。

# cli.vpn.status.state.starting
source: Tunnel: starting
ar: النفق: جاري البدء
de: Tunnel: Startet
es: Túnel: iniciando
fr: Tunnel : démarrage
ja: トンネル: 開始中
ko: 터널: 시작 중
zh_hans: 隧道：正在启动
zh_hant: 通道：正在啟動

# cli.vpn.status.state.awaitingApproval
source: Tunnel: waiting for approval in System Settings › General › Login Items & Extensions
ar: النفق: في انتظار الموافقة في إعدادات النظام › عام › عناصر تسجيل الدخول والامتدادات
de: Tunnel: Warten auf Freigabe unter Systemeinstellungen › Allgemein › Anmeldeobjekte & Erweiterungen
es: Túnel: esperando aprobación en Ajustes del Sistema › General › Ítems de inicio y extensiones
fr: Tunnel : en attente d'autorisation dans Réglages Système › Général › Ouverture et extensions
ja: トンネル: 「システム設定」›「一般」›「ログイン項目と機能拡張」での承認を待っています
ko: 터널: 시스템 설정 › 일반 › 로그인 항목 및 확장 프로그램에서 승인 대기 중
zh_hans: 隧道：正在等待“系统设置 › 通用 › 登录项与扩展”中的批准
zh_hant: 通道：正在等待「系統設定」›「一般」›「登入項目與延伸功能」中的核准

# cli.vpn.status.state.failed
source: Tunnel: failed (%@)
ar: النفق: فشل (%@)
de: Tunnel: Fehlgeschlagen (%@)
es: Túnel: falló (%@)
fr: Tunnel : échec (%@)
ja: トンネル: 失敗（%@）
ko: 터널: 실패 (%@)
zh_hans: 隧道：失败 (%@)
zh_hant: 通道：失敗 (%@)

# cli.vpn.status.downAppManaged
source: Tunnel: down (starts automatically when you open a Cloud machine)
ar: النفق: متوقف (يبدأ تلقائيًا عندما تفتح جهاز Cloud)
de: Tunnel: Ausgeschaltet (startet automatisch, wenn Sie eine Cloud-Maschine öffnen)
es: Túnel: desactivado (se inicia automáticamente al abrir una máquina de la nube)
fr: Tunnel : désactivé (démarre automatiquement lorsque vous ouvrez une machine Cloud)
ja: トンネル: 切断（クラウドマシンを開くと自動的に開始されます）
ko: 터널: 연결 해제됨 (Cloud 머신을 열면 자동으로 시작됨)
zh_hans: 隧道：已关闭（打开云机器时将自动启动）
zh_hant: 通道：已關閉 (在您開啟雲端機器時會自動啟動)

# cli.vpn.status.notSetUpAppManaged
source: Tunnel: not set up (enrolls automatically when you open a Cloud machine)
ar: النفق: غير مهيأ (يسجل تلقائيًا عندما تفتح جهاز Cloud)
de: Tunnel: Nicht eingerichtet (registriert sich automatisch, wenn Sie eine Cloud-Maschine öffnen)
es: Túnel: no configurado (se registra automáticamente al abrir una máquina de la nube)
fr: Tunnel : non configuré (s'enregistre automatiquement lorsque vous ouvrez une machine Cloud)
ja: トンネル: 未設定（クラウドマシンを開くと自動的に登録されます）
ko: 터널: 설정되지 않음 (Cloud 머신을 열면 자동으로 등록됨)
zh_hans: 隧道：未设置（打开云机器时将自动注册）
zh_hant: 通道：未設定 (在您開啟雲端機器時會自動註冊)

# cli.vpn.status.pinned
source: Pinned up by `cmux vpn up`; run `cmux vpn down` to release.
ar: مثبت بواسطة `cmux vpn up`؛ قم بتشغيل `cmux vpn down` للإلغاء.
de: Angeheftet durch `cmux vpn up`; führen Sie `cmux vpn down` aus, um freizugeben.
es: Anclado activo por `cmux vpn up`; ejecute `cmux vpn down` para liberarlo.
fr: Épinglé par `cmux vpn up` ; exécutez `cmux vpn down` pour le libérer.
ja: `cmux vpn up` により接続が固定されています。解除するには `cmux vpn down` を実行してください。
ko: `cmux vpn up`에 의해 연결 상태가 고정됨; 해제하려면 `cmux vpn down`을 실행하세요.
zh_hans: 通过 `cmux vpn up` 保持开启；运行 `cmux vpn down` 释放。
zh_hant: 已由 `cmux vpn up` 固定啟用；執行 `cmux vpn down` 以釋放。

# cli.vpn.status.autoManaged
source: The tunnel starts automatically when you open a Cloud machine and stops when no Cloud sessions remain.
ar: يبدأ النفق تلقائيًا عندما تفتح جهاز Cloud ويتوقف عندما لا تتبقى أي جلسات Cloud.
de: Der Tunnel startet automatisch, wenn Sie eine Cloud-Maschine öffnen, und stoppt, wenn keine Cloud-Sitzungen mehr verbleiben.
es: El túnel se inicia automáticamente al abrir una máquina de la nube y se detiene cuando no quedan sesiones en la nube.
fr: Le tunnel démarre automatiquement lorsque vous ouvrez une machine Cloud et s'arrête lorsqu'il ne reste plus de sessions Cloud.
ja: トンネルはクラウドマシンを開くと自動的に開始し、クラウドセッションがなくなると停止します。
ko: Cloud 머신을 열면 터널이 자동으로 시작되고, 남아 있는 Cloud 세션이 없을 때 중지됩니다.
zh_hans: 该隧道会在您打开云机器时自动启动，并在没有云会话残留时停止。
zh_hant: 通道會在您開啟雲端機器時自動啟動，並在沒有殘留任何雲端工作階段時停止。
